---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Curve..::..Intersect Method
Curve Class See Also Send Feedback
---

Calculates the intersection of this curve with the specified curve.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Intersect(Curve) | Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, IntersectionResultArray%) | Calculates the intersection of this curve with the specified curve and returns the intersection results. |

# See Also

Curve Class

Curve Members

Autodesk.Revit.DB Namespace